# Creating a managed Spark table
This notebook describes how to create a managed table from Spark. 
The table is created in the Synapse warehouse folder in your primary storage account. The table will be synchronized and available in Synapse SQL Pools.

In [7]:
spark.sql("CREATE TABLE cities (name STRING, population INT) USING PARQUET")

res2: org.apache.spark.sql.DataFrame = []

Insert a few rows into the table using a list of values.

In [8]:
spark.sql("INSERT INTO cities VALUES ('Seattle', 730400), ('San Francisco', 881549), ('Beijing', 21540000), ('Bangalore', 10540000)")

res3: org.apache.spark.sql.DataFrame = []

* Retrieve values back. Click on 'Chart' below to review the visualization.

In [9]:
display(spark.sql("SELECT * FROM cities ORDER BY name"))

Drop the table. Please note the data will get deleted from the primary storage account associated with this workspace.

In [10]:
spark.sql("DROP TABLE cities")

res5: org.apache.spark.sql.DataFrame = []